Checar somente linhas que as colunas correspondam a um critério

Sintaxe padrão: `SELECT coluna1, coluna2, ... FROM tabela WHERE condição;`

In [1]:
import sqlite3
import pandas as pd

Criando uma conexão com o banco de dados

In [2]:
con = sqlite3.connect('companhiaMB') 
cur = con.cursor() # salva comandos na memória
print('Conectado ao banco!')

Conectado ao banco!

Chegar o número de linhas

In [5]:
query = 'SELECT COUNT(*) as n_linhas FROM funcionarios'

df = pd.read_sql_query(query, con)
print(df)

   n_linhas
0         3

Filtrando uma consulta com WHERE

In [6]:
query = 'SELECT * FROM funcionarios'

df = pd.read_sql_query(query, con)
df

  PrimeiroNome UltimoNome  USERID  Salario  Aluguel
0      Matheus     Brasil    1997   1000.0    650.0
1      Vitória      Lopes    1998   2000.0    500.0
2      Eduardo      Silva    2001    800.0    200.0

In [8]:
query = 'SELECT PrimeiroNome, UltimoNome FROM funcionarios WHERE USERID < 2000'

df = pd.read_sql_query(query, con)
print(df)

  PrimeiroNome UltimoNome
0      Matheus     Brasil
1      Vitória      Lopes

Usar AND para usar duas condições

In [10]:
query = 'SELECT PrimeiroNome, UltimoNome FROM funcionarios WHERE USERID < 2000 AND Aluguel > 500'

df = pd.read_sql_query(query, con)
print(df)

  PrimeiroNome UltimoNome
0      Matheus     Brasil

Usar OR para que a consulta encontre pelo menos um dos critérios

In [13]:
query = 'SELECT PrimeiroNome, UltimoNome FROM funcionarios WHERE Salario > 1000 OR Aluguel > 500'

df = pd.read_sql_query(query, con)
print(df)

  PrimeiroNome UltimoNome
0      Matheus     Brasil
1      Vitória      Lopes

In [14]:
con.close()

Para mostrar outros exemplos,troquei a conexão para um banco de dados maior

In [16]:
con = sqlite3.connect('../primeiro_banco')

In [18]:
query = 'SELECT * FROM sqlite_master'

df = pd.read_sql_query(query, con)
print(df)

    type       name   tbl_name  rootpage  \
0  table      Teste      Teste         2
1  table  Customers  Customers         3

                                                 sql
0  CREATE TABLE Teste (\n        id integer,\n   ...
1  CREATE TABLE Customers (\n        CustomerKey ...

In [28]:
query = 'SELECT * FROM Customers LIMIT 1'

df = pd.read_sql_query(query, con)
df

,CustomerKey,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,JON,YANG,4/8/1966,M,M,jon24@adventure-works.com,"$90,000",2,Bachelors,Professional,Y

In [29]:
query = 'SELECT DISTINCT(EducationLevel) FROM Customers'

df = pd.read_sql_query(query, con)
df

        EducationLevel
0            Bachelors
1      Partial College
2          High School
3  Partial High School
4      Graduate Degree

In [33]:
query = 'SELECT DISTINCT(Occupation) FROM Customers'

df = pd.read_sql_query(query, con)
df

       Occupation
0    Professional
1      Management
2  Skilled Manual
3        Clerical
4          Manual

Usar IN para selecionar valores específicos

In [35]:
query = 'SELECT FirstName, Gender, AnnualIncome, EducationLevel FROM Customers WHERE EducationLevel in ("Bachelors", "Graduate Degree") LIMIT 10'

df = pd.read_sql_query(query, con)
df

   FirstName Gender AnnualIncome EducationLevel
0        JON      M     $90,000       Bachelors
1     EUGENE      M     $60,000       Bachelors
2      RUBEN      M     $60,000       Bachelors
3    CHRISTY      F     $70,000       Bachelors
4  ELIZABETH      F     $80,000       Bachelors
5      JULIO      M     $70,000       Bachelors
6      MARCO      M     $60,000       Bachelors
7      ROBIN      F     $60,000       Bachelors
8    SHANNON      M     $70,000       Bachelors
9  JACQUELYN      F     $70,000       Bachelors

Da mesma forma, usar NOT IN para excluir valores específicos.

In [36]:
query = 'SELECT FirstName, Gender, AnnualIncome, Occupation FROM Customers WHERE Occupation NOT IN ("Skilled Manual", "Manual",  "Clerical") LIMIT 10'

df = pd.read_sql_query(query, con)
df

   FirstName Gender AnnualIncome    Occupation
0        JON      M     $90,000   Professional
1     EUGENE      M     $60,000   Professional
2      RUBEN      M     $60,000   Professional
3    CHRISTY      F     $70,000   Professional
4  ELIZABETH      F     $80,000   Professional
5      JULIO      M     $70,000   Professional
6      MARCO      M     $60,000   Professional
7      ROBIN      F     $60,000   Professional
8    SHANNON      M     $70,000   Professional
9  JACQUELYN      F     $70,000   Professional